# ExecuteElementCheck Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPerformanceAdviserRule..::..ExecuteElementCheck Method
IPerformanceAdviserRule Interface See Also
---
Invoked by performance advisor for each element to be checked.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
void ExecuteElementCheck(
	Document document,
	Element element
)
```

Visual Basic
---
```text
Sub ExecuteElementCheck ( _
	document As Document, _
	element As Element _
)
```

Visual C++
---
```text
void ExecuteElementCheck(
	Document^ document,
	Element^ element
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Document for which performance problems are being checked.
element
    Type: Autodesk.Revit.DB..::..Element The Element being checked for performance problems.
# See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace